In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry', 'rohan', 'skillf', 'shubh'],
    "marks":[92, 34, 24, 17],
    "city":['rampur', 'kolkata', 'bareilly', 'antarctica']
}

In [3]:
df = pd.DataFrame(dict1) #It converts this into Exell sheet document

In [4]:
df

     name  marks        city
0   harry     92      rampur
1   rohan     34     kolkata
2  skillf     24    bareilly
3   shubh     17  antarctica

In [5]:
df.to_csv('friends1.csv')

In [6]:
df.to_csv('friends_index_false.csv')

In [7]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [8]:
df.tail(2)

     name  marks        city
2  skillf     24    bareilly
3   shubh     17  antarctica

In [9]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [10]:
T = pd.read_csv('Train.csv')

In [11]:
T

   Train No.  Speed        City
0      12545      52    Kolkata
1      15245     126     Rampur
2      35954      21      Delhi
3      45151     111  Bangalore

In [12]:
T.index = ['first', 'second', 'third', 'fourth'] #index are Rows

In [13]:
T

        Train No.  Speed        City
first       12545      52    Kolkata
second      15245     126     Rampur
third       35954      21      Delhi
fourth      45151     111  Bangalore

In [14]:
ser = pd.Series(np.random.rand(34))

In [15]:
ser.head()

0    0.392429
1    0.382799
2    0.581656
3    0.950076
4    0.767546
dtype: float64

In [16]:
type(ser)

pandas.core.series.Series

In [17]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [18]:
newdf.head()

          0         1         2         3         4
0  0.582793  0.732790  0.727270  0.632950  0.939672
1  0.587590  0.213604  0.012668  0.582275  0.887989
2  0.039109  0.368803  0.101702  0.023641  0.255052
3  0.990438  0.165843  0.475520  0.429048  0.269076
4  0.303014  0.051501  0.122862  0.666574  0.265433

In [19]:
type(newdf)

pandas.core.frame.DataFrame

In [20]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.511564    0.484384    0.492743    0.495876    0.504321
std      0.281297    0.276758    0.288392    0.286660    0.292587
min      0.002718    0.002258    0.000630    0.001983    0.002560
25%      0.276249    0.233004    0.254221    0.238775    0.251327
50%      0.522906    0.485998    0.481506    0.492581    0.507252
75%      0.746495    0.709457    0.740884    0.741965    0.743450
max      0.996345    0.998751    0.997741    0.993028    0.998419

In [21]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [22]:
newdf[0][0] = 'harry'

In [23]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [24]:
newdf.head()

           0         1         2         3         4
0      harry  0.732790  0.727270  0.632950  0.939672
1    0.58759  0.213604  0.012668  0.582275  0.887989
2  0.0391092  0.368803  0.101702  0.023641  0.255052
3   0.990438  0.165843  0.475520  0.429048  0.269076
4   0.303014  0.051501  0.122862  0.666574  0.265433

In [25]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [26]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [27]:
newdf.to_numpy()

array([['harry', 0.732789998555978, 0.7272695618025184,
        0.6329503083359986, 0.9396717178212309],
       [0.5875896099400506, 0.21360394774725522, 0.012668165438284862,
        0.5822751443138506, 0.8879893835463452],
       [0.03910923393305632, 0.36880265757683073, 0.10170197915846213,
        0.023640746977343752, 0.25505171350432465],
       ...,
       [0.06905687658910198, 0.7030362006283478, 0.7051886099281018,
        0.4010743116092227, 0.8469994508251109],
       [0.9103330714575818, 0.9116266806679838, 0.47925962828354296,
        0.15409509141493638, 0.6832473317732145],
       [0.9023127068803591, 0.3314860023157026, 0.5087336628518883,
        0.8340185361569132, 0.29131634828271313]], dtype=object)

In [28]:
newdf[0][0] = 0.3

<ipython-input-28-452ed7015823>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[0][0] = 0.3

In [29]:
newdf.head()

           0         1         2         3         4
0        0.3  0.732790  0.727270  0.632950  0.939672
1    0.58759  0.213604  0.012668  0.582275  0.887989
2  0.0391092  0.368803  0.101702  0.023641  0.255052
3   0.990438  0.165843  0.475520  0.429048  0.269076
4   0.303014  0.051501  0.122862  0.666574  0.265433

In [30]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.58759,0.0391092,0.990438,0.303014,0.136335,0.701101,0.121119,0.25796,0.936542,...,0.895146,0.644655,0.430901,0.726481,0.621935,0.159084,0.161786,0.0690569,0.910333,0.902313
1,0.73279,0.213604,0.368803,0.165843,0.0515008,0.47508,0.711977,0.209589,0.478518,0.482017,...,0.634311,0.0546757,0.591933,0.195945,0.696076,0.165603,0.736154,0.703036,0.911627,0.331486
2,0.72727,0.0126682,0.101702,0.47552,0.122862,0.102471,0.125405,0.850334,0.135725,0.528649,...,0.806851,0.478334,0.0340097,0.770572,0.483753,0.685071,0.997741,0.705189,0.47926,0.508734
3,0.63295,0.582275,0.0236407,0.429048,0.666574,0.21227,0.91752,0.300847,0.871976,0.241455,...,0.272106,0.219613,0.316167,0.788618,0.88327,0.851605,0.888714,0.401074,0.154095,0.834019
4,0.939672,0.887989,0.255052,0.269076,0.265433,0.96038,0.0474975,0.00673746,0.959029,0.50647,...,0.0563678,0.253419,0.25061,0.677735,0.92162,0.0749822,0.172033,0.846999,0.683247,0.291316

In [31]:
newdf.head()

           0         1         2         3         4
0        0.3  0.732790  0.727270  0.632950  0.939672
1    0.58759  0.213604  0.012668  0.582275  0.887989
2  0.0391092  0.368803  0.101702  0.023641  0.255052
3   0.990438  0.165843  0.475520  0.429048  0.269076
4   0.303014  0.051501  0.122862  0.666574  0.265433

In [32]:
newdf.sort_index(axis = 0, ascending = False)

             0         1         2         3         4
333   0.902313  0.331486  0.508734  0.834019  0.291316
332   0.910333  0.911627  0.479260  0.154095  0.683247
331  0.0690569  0.703036  0.705189  0.401074  0.846999
330   0.161786  0.736154  0.997741  0.888714  0.172033
329   0.159084  0.165603  0.685071  0.851605  0.074982
..         ...       ...       ...       ...       ...
4     0.303014  0.051501  0.122862  0.666574  0.265433
3     0.990438  0.165843  0.475520  0.429048  0.269076
2    0.0391092  0.368803  0.101702  0.023641  0.255052
1      0.58759  0.213604  0.012668  0.582275  0.887989
0          0.3  0.732790  0.727270  0.632950  0.939672

[334 rows x 5 columns]

In [33]:
newdf.sort_index(axis = 1, ascending = False)

            4         3         2         1          0
0    0.939672  0.632950  0.727270  0.732790        0.3
1    0.887989  0.582275  0.012668  0.213604    0.58759
2    0.255052  0.023641  0.101702  0.368803  0.0391092
3    0.269076  0.429048  0.475520  0.165843   0.990438
4    0.265433  0.666574  0.122862  0.051501   0.303014
..        ...       ...       ...       ...        ...
329  0.074982  0.851605  0.685071  0.165603   0.159084
330  0.172033  0.888714  0.997741  0.736154   0.161786
331  0.846999  0.401074  0.705189  0.703036  0.0690569
332  0.683247  0.154095  0.479260  0.911627   0.910333
333  0.291316  0.834019  0.508734  0.331486   0.902313

[334 rows x 5 columns]

In [34]:
newdf.head()

           0         1         2         3         4
0        0.3  0.732790  0.727270  0.632950  0.939672
1    0.58759  0.213604  0.012668  0.582275  0.887989
2  0.0391092  0.368803  0.101702  0.023641  0.255052
3   0.990438  0.165843  0.475520  0.429048  0.269076
4   0.303014  0.051501  0.122862  0.666574  0.265433

In [35]:
type(newdf[0])

pandas.core.series.Series

In [36]:
newdf2 = newdf #newdf2 is a view or pointer that is pointing towards rhe newdf
#newdf2 = newdf.copy() does not change newdf value

In [37]:
newdf[0][0] = 97835

<ipython-input-37-9e16c8ee0a00>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[0][0] = 97835

In [38]:
newdf

             0         1         2         3         4
0        97835  0.732790  0.727270  0.632950  0.939672
1      0.58759  0.213604  0.012668  0.582275  0.887989
2    0.0391092  0.368803  0.101702  0.023641  0.255052
3     0.990438  0.165843  0.475520  0.429048  0.269076
4     0.303014  0.051501  0.122862  0.666574  0.265433
..         ...       ...       ...       ...       ...
329   0.159084  0.165603  0.685071  0.851605  0.074982
330   0.161786  0.736154  0.997741  0.888714  0.172033
331  0.0690569  0.703036  0.705189  0.401074  0.846999
332   0.910333  0.911627  0.479260  0.154095  0.683247
333   0.902313  0.331486  0.508734  0.834019  0.291316

[334 rows x 5 columns]

In [39]:
# Recomended way
newdf.loc[0,0] = 654

In [40]:
newdf.head(2)

         0         1         2         3         4
0      654  0.732790  0.727270  0.632950  0.939672
1  0.58759  0.213604  0.012668  0.582275  0.887989

In [41]:
newdf.coulmns = list("ABCDE")

<ipython-input-41-cedcd9916dfe>:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  newdf.coulmns = list("ABCDE")

In [42]:
newdf.head(2)

         0         1         2         3         4
0      654  0.732790  0.727270  0.632950  0.939672
1  0.58759  0.213604  0.012668  0.582275  0.887989

In [43]:
newdf.loc[[1,2], [3,4]]

          3         4
1  0.582275  0.887989
2  0.023641  0.255052

In [44]:
newdf.loc[[1,2], :]

           0         1         2         3         4
1    0.58759  0.213604  0.012668  0.582275  0.887989
2  0.0391092  0.368803  0.101702  0.023641  0.255052

In [45]:
newdf.loc[(newdf[0]<0.3) & (newdf[2]>0.1)] #For columns

              0         1         2         3         4
2     0.0391092  0.368803  0.101702  0.023641  0.255052
5      0.136335  0.475080  0.102471  0.212270  0.960380
7      0.121119  0.209589  0.850334  0.300847  0.006737
8       0.25796  0.478518  0.135725  0.871976  0.959029
18     0.233952  0.166216  0.976332  0.151051  0.158276
..          ...       ...       ...       ...       ...
312    0.093967  0.511076  0.333917  0.952683  0.108173
320  0.00271836  0.505293  0.114039  0.753439  0.809598
329    0.159084  0.165603  0.685071  0.851605  0.074982
330    0.161786  0.736154  0.997741  0.888714  0.172033
331   0.0690569  0.703036  0.705189  0.401074  0.846999

[88 rows x 5 columns]

In [46]:
newdf.head()

           0         1         2         3         4
0        654  0.732790  0.727270  0.632950  0.939672
1    0.58759  0.213604  0.012668  0.582275  0.887989
2  0.0391092  0.368803  0.101702  0.023641  0.255052
3   0.990438  0.165843  0.475520  0.429048  0.269076
4   0.303014  0.051501  0.122862  0.666574  0.265433

In [47]:
newdf.iloc[0,4]

0.9396717178212309

In [48]:
newdf.iloc[[0,5], [1,2]]

         1         2
0  0.73279  0.727270
5  0.47508  0.102471

In [50]:
newdf.head(3)

           0         1         2         3         4
0        654  0.732790  0.727270  0.632950  0.939672
1    0.58759  0.213604  0.012668  0.582275  0.887989
2  0.0391092  0.368803  0.101702  0.023641  0.255052

In [51]:
newdf.drop([0]) #Dropping Row

             0         1         2         3         4
1      0.58759  0.213604  0.012668  0.582275  0.887989
2    0.0391092  0.368803  0.101702  0.023641  0.255052
3     0.990438  0.165843  0.475520  0.429048  0.269076
4     0.303014  0.051501  0.122862  0.666574  0.265433
5     0.136335  0.475080  0.102471  0.212270  0.960380
..         ...       ...       ...       ...       ...
329   0.159084  0.165603  0.685071  0.851605  0.074982
330   0.161786  0.736154  0.997741  0.888714  0.172033
331  0.0690569  0.703036  0.705189  0.401074  0.846999
332   0.910333  0.911627  0.479260  0.154095  0.683247
333   0.902313  0.331486  0.508734  0.834019  0.291316

[333 rows x 5 columns]

In [54]:
newdf.drop([0, 3], axis=1) # Dropping Colunm
# If newdf = | or (, inplace= True]

            1         2         4
0    0.732790  0.727270  0.939672
1    0.213604  0.012668  0.887989
2    0.368803  0.101702  0.255052
3    0.165843  0.475520  0.269076
4    0.051501  0.122862  0.265433
..        ...       ...       ...
329  0.165603  0.685071  0.074982
330  0.736154  0.997741  0.172033
331  0.703036  0.705189  0.846999
332  0.911627  0.479260  0.683247
333  0.331486  0.508734  0.291316

[334 rows x 3 columns]

In [55]:
newdf.reset_index(drop = True, inplace = True)
# Reset indexes

In [56]:
newdf.head(3)

           0         1         2         3         4
0        654  0.732790  0.727270  0.632950  0.939672
1    0.58759  0.213604  0.012668  0.582275  0.887989
2  0.0391092  0.368803  0.101702  0.023641  0.255052

In [57]:
newdf[2].isnull() #It returns true wherever there is null

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: 2, Length: 334, dtype: bool

In [62]:
newdf[2] = None #It returns none or second way for this is
newdf.loc[:, [2]] = 56

In [63]:
newdf.head(3)

           0         1   2         3         4
0        654  0.732790  56  0.632950  0.939672
1    0.58759  0.213604  56  0.582275  0.887989
2  0.0391092  0.368803  56  0.023641  0.255052

In [82]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, np.nan, np.nan],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [83]:
df.head() # When batmobile and bullwhip is changes to np.nan

     name  toy       born
0  Alfred  NaN        NaT
1  Batman  NaN 1940-04-25
2  Alfred  NaN        NaT

In [84]:
df.dropna()

Empty DataFrame
Columns: [name, toy, born]
Index: []

In [85]:
df.dropna(how = 'all', axis =1) # This will remove NaN

     name       born
0  Alfred        NaT
1  Batman 1940-04-25
2  Alfred        NaT

In [86]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [88]:
df.drop_duplicates(subset = ['name'], keep = False)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [89]:
df.shape , df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 112.0+ bytes

((3, 3), None)

In [90]:
 df['name'].value_counts(dropna = False)

Alfred    2
Batman    1
Name: name, dtype: int64

In [91]:
data = pd.read_excel('data.xlsx', sheet_name ='Sheet1' )

In [92]:
data

   Train No.  Speed        City
0      12545      52    Kolkata
1      15245     126     Rampur
2      35954      21      Delhi
3      45151     111  Bangalore

In [94]:
data.iloc[0,0] = 34

In [95]:
data

   Train No.  Speed        City
0         34      52    Kolkata
1      15245     126     Rampur
2      35954      21      Delhi
3      45151     111  Bangalore

In [97]:
data.to_excel('data.xlsx', sheet_name ='Sheet1')

In [98]:
data

   Train No.  Speed        City
0         34      52    Kolkata
1      15245     126     Rampur
2      35954      21      Delhi
3      45151     111  Bangalore

In [100]:
# Create a dataframe which contains only integers with 3 rows an 2 columns
# run following dataframe methods on them:
'''df.describe()
df.mean()
df.corr()
df.count()
df.max()
df.min()
df.meadian()
df.std()'''

'df.describe()\ndf.mean()\ndf.corr()\ndf.count()\ndf.max()\ndf.min()\ndf.meadian()\ndf.std()'